#########################################################################
#DNSLOG配置
#没有的可以去ceye中申请，http://ceye.io/
#如果使用的是ceye模式，没有改为你的Key会导致有些远程命令执行无法检测
#默认使用的是dnslog.cn模式
#dnslog目前包括(dnslog.cn,ceye)
#稳定性ceye>dnslog.cn
#########################################################################
dnslog_name="dnslog.cn"#切换使用那个dnslog
ceye_dnslog_url="XXXXX.ceye.io"
ceye_dnslog_key="XXXXXXXXXXXXXXXXXXXXXXXX"

#########################################################################
#Debug模式切换位置
#默认是关闭的
#如果自行搭建web版，请改为Ture，这样会快很多
#########################################################################
debug_mode=False

#########################################################################
#线程数配置位置
#线程最好别开太大容易被发现
#########################################################################
thread_number=15 #默认线程数
thread_timeout_number=5#防止报错等操作导致的超时


#########################################################################
#Redis配置
#如果自行配置web，请同步修改redis相关配置
#########################################################################
redis_host="localhost"#连接redis的地址，默认本地
redis_port="6379"#redis连接端口，默认6379
redis_db="6"#连接的数据库，默认为6
redis_password="I_will_always_like_Rei_Ayanami"#连接redis的密码


#########################################################################
#端口扫描配置
#########################################################################
port_threads_number=20#端口扫描默认线程
port_timeout_period=2#端口扫描默认超时时间

#########################################################################
#Github监控配置
#默认工作间隔为60秒，
#########################################################################
github_cve_job_time=60#60秒请求一次
